#include <stdio.h>

int main(void)
{
    printf("Hello world!\n");
    // Программа, взаимодействующая с X-сервером, выполняет следующие действия:
    // TODO: 1. устанавливает соединение с Х-сервером;
    // Display *d = XOpenDisplay (NULL);

    // Display *d = XOpenDisplay (getenv("DISPLAY"))
    // Display *d = XOpenDisplay ("127.0.0.1:0.0").
    // TODO: 2. инициализирует графическую подсистему;

    // TODO: 3. описывает и отображает на экране окно;

    // TODO: 4. запускает цикл, в котором самостоятельно выбирает из очереди и обслуживает приходящие в окно сообщения;

    // TODO: 5. если сообщение «завершающее», то выходит из цикла;

    // TODO: 6. закрывает окно и разрывает соединение с X-сервером.

}
